In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [5]:
# convert series into list
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [6]:
l1 = list(df['Name'])

In [7]:
type(l1)

list

In [8]:
# convert list into series
s1 = pd.Series(l1)

In [9]:
type(s1)

pandas.core.series.Series

In [10]:
s1

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Length: 891, dtype: object

In [11]:
l2 = ["a","b","c"]
s2 = pd.Series(l2)
print(s2)

0    a
1    b
2    c
dtype: object

In [12]:
# Reindexing a series object
pd.Series(list(s2),index=["x","y","z"])

x    a
y    b
z    c
dtype: object

In [13]:
# Note the series is converted to list in above cell as if we call Series() on a series it behaves like below
pd.Series(s2,index=["x","y","z"])

x    NaN
y    NaN
z    NaN
dtype: object

In [14]:
s = df["Name"][0:6]

In [15]:
s_1 = df["Name"][6:11]

In [16]:
s

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
5                                     Moran, Mr. James
Name: Name, dtype: object

In [17]:
s_1

6                               McCarthy, Mr. Timothy J
7                        Palsson, Master. Gosta Leonard
8     Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                   Nasser, Mrs. Nicholas (Adele Achem)
10                      Sandstrom, Miss. Marguerite Rut
Name: Name, dtype: object

In [18]:
# IMP Note: Adding series does append the indecies properly but it looses the value
s + s_1

0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
5     NaN
6     NaN
7     NaN
8     NaN
9     NaN
10    NaN
Name: Name, dtype: object

In [19]:
# Instead use concat
pd.concat([s,s_1])

0                               Braund, Mr. Owen Harris
1     Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                Heikkinen, Miss. Laina
3          Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                              Allen, Mr. William Henry
5                                      Moran, Mr. James
6                               McCarthy, Mr. Timothy J
7                        Palsson, Master. Gosta Leonard
8     Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                   Nasser, Mrs. Nicholas (Adele Achem)
10                      Sandstrom, Miss. Marguerite Rut
Name: Name, dtype: object

In [20]:
s_2 = pd.concat([s,s_1])

In [21]:
s_2 * 3

0     Braund, Mr. Owen HarrisBraund, Mr. Owen Harris...
1     Cumings, Mrs. John Bradley (Florence Briggs Th...
2     Heikkinen, Miss. LainaHeikkinen, Miss. LainaHe...
3     Futrelle, Mrs. Jacques Heath (Lily May Peel)Fu...
4     Allen, Mr. William HenryAllen, Mr. William Hen...
5      Moran, Mr. JamesMoran, Mr. JamesMoran, Mr. James
6     McCarthy, Mr. Timothy JMcCarthy, Mr. Timothy J...
7     Palsson, Master. Gosta LeonardPalsson, Master....
8     Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Be...
9     Nasser, Mrs. Nicholas (Adele Achem)Nasser, Mrs...
10    Sandstrom, Miss. Marguerite RutSandstrom, Miss...
Name: Name, dtype: object

#### Axis = 0, is for Rows
#### Axis = 1, is for Columns

In [22]:
# If axis is not mentioned by default axis = 0 
df.drop('SibSp')

KeyError: "['SibSp'] not found in axis"

In [ ]:
df.drop('SibSp',axis=1)

In [ ]:
# Note that even after drop the column 'SibSp' is still there
# this is because df.drop('SibSp') just drops the column and returns a view as inplace =Flase by default
df.head()

In [ ]:
# Usually Inplace is not recommened 
df.drop('SibSp',axis=1,inplace=True)

In [ ]:
# Instead use re-assignment to solve the issue
df = df.drop('SibSp',axis=1)

In [ ]:
# Drop a row 
df.drop(4)

In [ ]:
df.head()

In [ ]:
df =df.drop(3)

In [ ]:
df.head()

In [ ]:
# Changing the index of a df
df = df.set_index('Name')

In [ ]:
df.head()

In [ ]:
df.loc['Allen, Mr. William Henry']

In [ ]:
df.iloc[3]

In [ ]:
df= df.reset_index()

In [ ]:
df.head()

In [ ]:
# Convert dict to df
d ={
    "key1":[1,2,3,4,5],
    "key2":[543,2342,423,42344,5423]
}

In [ ]:
pd.DataFrame(d)

In [ ]:
df1 = pd.read_csv("taxonomy.csv.xls")

In [ ]:
df1.head()

In [ ]:
df1.describe()

In [ ]:
# Handling NaN values
df1.dropna()

In [ ]:
df1.head()

In [ ]:
df1.dropna(axis=1)

In [ ]:
# Handling Na values
df1.fillna("Test")

In [ ]:
df.head()

In [ ]:
# Group operations
df.groupby('Survived').count()

In [ ]:
# Get the fare paid by male / female
df[['Fare','Sex']].groupby('Sex').sum()

In [ ]:
df[['Age','Sex']].groupby('Sex').mean()

In [ ]:
# Get the number of people in each class
df[['Pclass','Name']].groupby('Pclass').count()

In [ ]:
# Get the fare collection in each class
df[['Pclass','Fare']].groupby('Pclass').sum()

In [ ]:
fare_df = df[['Pclass','Fare']].groupby('Pclass').sum()

In [ ]:
# Transpose 
fare_df

In [ ]:
fare_df.T

In [ ]:
df.head()

In [ ]:
df_1 = df[['Name','Survived','Pclass']][0:6]

In [ ]:
df_1

In [ ]:
df_2 = df[['Name','Survived','Pclass']][6:11]

In [ ]:
df_2

In [ ]:
# Concatenate dfs horizontally
pd.concat([df_1,df_2])

In [ ]:
# Concatenate dfs vertically
pd.concat([df_1,df_2],axis=1)

In [ ]:
df_d1 = pd.DataFrame({
    "key1":[1,2,3,4,5],
    "key2":[6,7,8,9,10],
    "key3":[16,71,18,19,11],
})

In [ ]:
df_d1

In [ ]:
df_d2 = pd.DataFrame({
    "key1":[11,2,13,14,15],
    "key4":[60,70,80,90,0],
    "key5":[26,72,22,29,21],
})

In [ ]:
df_d2

In [ ]:
# Note by default merge will do an inner join
# in this case key1 (available in both dfs) = 2 is used for the merge
pd.merge(df_d1,df_d2)

In [ ]:
pd.merge(df_d1,df_d2,how='left')

In [ ]:
pd.merge(df_d1,df_d2,how='right')

In [ ]:
pd.merge(df_d1,df_d2,how='outer')

In [ ]:
pd.merge(df_d1,df_d2,how='cross')

In [ ]:
df_d1

In [ ]:
df_d2 = pd.DataFrame({
    "key1":[11,2,13,14,15],
    "key4":[60,70,3,90,0],
    "key5":[26,72,22,29,21],
})

In [ ]:
df_d2

In [ ]:
# the join column can be mentioned like below
pd.merge(df_d1,df_d2,how='left',left_on="key1",right_on="key4")

In [57]:
data_1 = pd.DataFrame({
    "uid":[1,2,3,4,5],
    "age":[2,270,3,90,0],
    "height":[3,4,22,29,21],
    "name":["a","b","c","d","e"]
})
data_2 = pd.DataFrame({
    "uid":[2,270,3,90,1],
    "xp":[1,2,3,4,5],
    "attack":[3,4,22,29,21],
    "nm":["b","1b","1c","1d","a"]
})

In [58]:
data_1

   uid  age  height name
0    1    2       3    a
1    2  270       4    b
2    3    3      22    c
3    4   90      29    d
4    5    0      21    e

In [59]:
data_2

   uid  xp  attack  nm
0    2   1       3   b
1  270   2       4  1b
2    3   3      22  1c
3   90   4      29  1d
4    1   5      21   a

In [60]:
# pd will automatically identify the join column 
pd.merge(left=data_1,right=data_2,how='inner')

   uid  age  height name  xp  attack  nm
0    1    2       3    a   5      21   a
1    2  270       4    b   1       3   b
2    3    3      22    c   3      22  1c

In [61]:
# Specifically mention the left_on column and the right_on column to complete the join
pd.merge(left=data_1,right=data_2,how='inner' ,left_on='name',right_on='nm')

   uid_x  age  height name  uid_y  xp  attack nm
0      1    2       3    a      1   5      21  a
1      2  270       4    b      2   1       3  b

In [62]:
# left join 
# Builds the result based on records of data_1 
# merges the fields of data_2 and fills in the data_2 values for ones that satisfy the join condition with data_1
# remaining fields that do not intersect with data_1 are filled in as NaN

pd.merge(left=data_1,right=data_2,how='left' ,left_on='name',right_on='nm')

   uid_x  age  height name  uid_y   xp  attack   nm
0      1    2       3    a    1.0  5.0    21.0    a
1      2  270       4    b    2.0  1.0     3.0    b
2      3    3      22    c    NaN  NaN     NaN  NaN
3      4   90      29    d    NaN  NaN     NaN  NaN
4      5    0      21    e    NaN  NaN     NaN  NaN

In [63]:
# Right join
pd.merge(left=data_1,right=data_2,how='right' ,left_on='name',right_on='nm')

   uid_x    age  height name  uid_y  xp  attack  nm
0    2.0  270.0     4.0    b      2   1       3   b
1    NaN    NaN     NaN  NaN    270   2       4  1b
2    NaN    NaN     NaN  NaN      3   3      22  1c
3    NaN    NaN     NaN  NaN     90   4      29  1d
4    1.0    2.0     3.0    a      1   5      21   a

In [65]:
# cross merge does not exists
pd.merge(left=data_1,right=data_2,how='cross' ,left_on='name',right_on='nm')

MergeError: Can not pass on, right_on, left_on or set right_index=True or left_index=True

In [66]:
data_1.join(data_2)

ValueError: columns overlap but no suffix specified: Index(['uid'], dtype='object')

In [67]:
# The above error occured because df.join() expects no collumn overlap between the dfs
# this is because join uses index as the join condition and having 2 columns with same name in the df is not expected while join
data_1 = pd.DataFrame({
    "uid":[1,2,3,4,5],
    "age":[2,270,3,90,0],
    "height":[3,4,22,29,21],
    "name":["a","b","c","d","e"]
})
data_2 = pd.DataFrame({
    "uid2":[2,270,3,90,1],
    "xp":[1,2,3,4,5],
    "attack":[3,4,22,29,21],
    "nm":["b","1b","1c","1d","a"]
})

In [68]:
# After renaming uid to uid2 the join works
# note that the join has essentially joined the dfs horizontally
data_1.join(data_2)

   uid  age  height name  uid2  xp  attack  nm
0    1    2       3    a     2   1       3   b
1    2  270       4    b   270   2       4  1b
2    3    3      22    c     3   3      22  1c
3    4   90      29    d    90   4      29  1d
4    5    0      21    e     1   5      21   a

In [69]:
# lets play with the index and then do a join
data_1 = pd.DataFrame({
    "uid":[1,2,3,4,5],
    "age":[2,270,3,90,0],
    "height":[3,4,22,29,21],
    "name":["a","b","c","d","e"]
},index=[1,2,3,4,5])
data_2 = pd.DataFrame({
    "uid2":[2,270,3,90,1],
    "xp":[1,2,3,4,5],
    "attack":[3,4,22,29,21],
    "nm":["b","1b","1c","1d","a"]
},index=[6,7,8,3,9])

In [70]:
# Now since the indices between the df do not overlap completely we see that left join
# and hence the NaN values
data_1.join(data_2)

   uid  age  height name  uid2   xp  attack   nm
1    1    2       3    a   NaN  NaN     NaN  NaN
2    2  270       4    b   NaN  NaN     NaN  NaN
3    3    3      22    c  90.0  4.0    29.0   1d
4    4   90      29    d   NaN  NaN     NaN  NaN
5    5    0      21    e   NaN  NaN     NaN  NaN

In [71]:
data_1.join(data_2,how='right')

   uid  age  height name  uid2  xp  attack  nm
6  NaN  NaN     NaN  NaN     2   1       3   b
7  NaN  NaN     NaN  NaN   270   2       4  1b
8  NaN  NaN     NaN  NaN     3   3      22  1c
3  3.0  3.0    22.0    c    90   4      29  1d
9  NaN  NaN     NaN  NaN     1   5      21   a

In [72]:
data_1.join(data_2,how='cross')

    uid  age  height name  uid2  xp  attack  nm
0     1    2       3    a     2   1       3   b
1     1    2       3    a   270   2       4  1b
2     1    2       3    a     3   3      22  1c
3     1    2       3    a    90   4      29  1d
4     1    2       3    a     1   5      21   a
5     2  270       4    b     2   1       3   b
6     2  270       4    b   270   2       4  1b
7     2  270       4    b     3   3      22  1c
8     2  270       4    b    90   4      29  1d
9     2  270       4    b     1   5      21   a
10    3    3      22    c     2   1       3   b
11    3    3      22    c   270   2       4  1b
12    3    3      22    c     3   3      22  1c
13    3    3      22    c    90   4      29  1d
14    3    3      22    c     1   5      21   a
15    4   90      29    d     2   1       3   b
16    4   90      29    d   270   2       4  1b
17    4   90      29    d     3   3      22  1c
18    4   90      29    d    90   4      29  1d
19    4   90      29    d     1   5      21   a
20    5    0      21    e     2   1       3   b
21    5    0      21    e   270   2       4  1b
22    5    0      21    e     3   3      22  1c
23    5    0      21    e    90   4      29  1d
24    5    0      21    e     1   5      21   a

In [73]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [75]:
# Create a new column for fare in INR
df['Fare_inr'] = df['Fare'].apply(lambda x: x*80)

In [76]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_inr
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,580.000
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,5702.664
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,634.000
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,4248.000
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,644.000

In [81]:
# Create buckets for grouping data with apply function
df['Age_group'] = df['Age'].apply(lambda x: "low" if x <= 10 else ("mid" if x > 10 and x < 40 else "high"))